[
    {
        "id": 1,
        "image": "",
        "title": "Promineo FE Bootcamp Review",
        "description": "A look at the pros and cons of code bootcamps, including their impact on the tech industry and the skills they teach.",
        "date": "2024-01-01",
        "url": ""
    },
    {
        "id": 2,
        "image": "",
        "title": "The Old Gods and a Rotten Cork",
        "description": "A travel piece on Peru.",
        "body": "Shriveled into a Peruvian taxi, my lip was curled not from a smile but from the leaf of the Andes. Ordinary life trickled by as a stream passes water. Red fertile soil, bits of highway rubbish, houses textured with bright colors, and desert roads etched into mountains like veins on an arm. Moments like these are invigorating like a lucid dream. We were leaving Cusco for Aguas Calientes and eventually Machu Picchu. Early in the morning, after coffee and a stout Andean headache, we met our taxi driver on the cobblestone street outside our hotel. We jerry-rigged, oversized luggage into an undersized trunk in the chaotic way one packs for a trip last minute. Our taxi was just like the rest of them: rickety, manufactured by a company I’ve never heard of, and full of characters. My partner Sam, her mom, and I slotted into the taxi and rattled as much as our luggage did in the crowded Peruvian traffic. Our taxi driver David released the emergency brake in the way a chiropractor breaks a neck – we were off.\n\nBreaking the ice with our driver was unusually hard. There was a certain stiffness in the air akin to the first time you shake your wife’s gynecologist’s hand. Gentle smiles and a small dose of generosity can make up for bad Spanish. David’s short responses felt taciturn and his body language rubbed off on everyone like sandpaper. Most tour guides are hitched to a formal outfit in Peru and most studied tourism for their undergrad. Peruvians see this as a very culturally important occupation; as cultural preservation and control over a narrative has only recently been reclaimed. David wasn’t a polished tour guide. He spoke enough English to be self-conscious about it and his knowledge of the land meandered as much as an Andean highway. He was a taxi driver who was learning how to be a tour guide – and we were all learning how to travel together. Breaking the ice with each tour guide came with its unique set of personality-challenges. Some of our guides were soft spoken, or men of few words, or sexist-machismo surf instructors. Regardless, our strategy was for the girls to speak Spanish and on occasion I'd confidently hallucinate Pseudo-Spanish for comedic relief. We had a good cop, silly cop energy to us. Every taxi ride would start out with extending a, “Señor” and a handful of coca leaf.\n\nWe were flying around steep corners, in a glorified go kart, that could only make Glacier National Park envious. In moments like these I’m reminded that there is little difference between a spaceship and a bomb. Raw red-clay road barely clung unto the ever changing earth. I felt alive not because we were experiencing the safe thrills of Disney Land or enjoying a martini on the beach but because we were traveling outside of our comfort zone and with real risk. Real travel requires a certain loosening of one’s grip. Driving in Peru is more fluid. The road works together more like a Jazz band than a symphony. In Peruvian cities, you have to improvise space for your vehicle otherwise your space gets swallowed up. Sometimes you have your solo (speedily swerving around traffic), and sometimes you're the rhythm section meandering along with everyone else. To relax and enjoy the experiences of travel – you have to surrender some of your control and loosen up. The predictability of orchestrated life is useful in daily life(we need to be able to predict our schedules to play on time with everyone else). But the whole point of traveling is to disrupt the mundane and the predictable; forgetting this allows the mind to remember that there are many ways to live a good life.\n\nCusco’s central square harbored attention with prominent old churches, Quechua art, and loud markets. But my attention wandered out toward the hills, where the real Cusco was. The Cusco where the people lived. But seeing into the real life of the area isn’t what tourism is for the most part. The realness of cities are obfuscated away. You only run into the working class when traveling if they have food for you or are providing a short service. This happened a lot when I worked at a luxury resort. The people who visited said, “It must be great living where other people vacation”. I’ve never lived where they vacationed but if I did – I wouldn’t be working there. Unfortunately, there is a large distance between a tourists perception of a place and the realities of living in said place.\n\nWhatever comprises Cusco and Peru – you can’t say it lacks quirks and personality. The last night I stayed in Cusco, I was compelled to explore the part of the city where outsiders get squinted at for walking around. Half way through my walk I saw a female hotel receptionist reorient her male counterpart in ALL CAPS, after taking off a high heel to knock some sense into him. Whatever was being communicated was raw, her voice was shrill, and her posture was pointed. I don’t know if he cheated on her or if he gambled away money that shouldn’t have been gambled or if he said something off color - but the realness of life was surely never blurred away. I saw groups of people escaping the hassle of life drinking outside of convenience stores, street dogs that whimpered, bad attitudes, loud bar music, stagnant street puddles, and pharmacies named “Drugtore” with a depiction of a white guy in a white coat. The absence of perfectionism was a breath of fresh air. The opposite city of Cusco Peru resides in a county(in the U.S) that no longer exhibits what it was named after, Orange County.\n\nIrvine, California on the other hand is the anti-city to Cusco Peru. Irvine, the polite society of Hot yoga, cinema, grocery stores, elite golf clubs, and any kind of comfort that you can afford to get you away from your wife and kids are never further than a spitball’s distance away. Comforts were always considered in Irvine. The perfectly laid out city streets, the pompous people, and low crime rate make the city feel like it has been bubble wrapped in gold. Simply put, Irvine is as sterile as the drinking water at a bleach plant and I’d rather risk dying of dysentery than of stage-four colorectal cancer. Perfection gives me the heebiejeebies. If Irvine ever had a soul it was long before the perfectly laid-out streets of suburbistan.\n\nLeaving Cusco, the brakes slowed us as the car squeezed the pressure in my head like a balloon about to burst. The elevation headache pulled me out of my daydream as the back seat window revealed winding sidewalks staggered together like Tetris blocks. The girls and I were enjoying the silence. We were a week into spending the most time together as we ever had. Our crammed elbows were relieved by taxi rides filled mostly with our own solipsistic mental ambience. The silence in the air doubled down when David looked through the thin membrane of the rear view mirror, asking if we wanted him to be our tour guide on our next stop. We all looked at one another in the way a group scrambles to figure out how to politely say no. We all knew that the best guides at historical sites huddled at the entrance. Before we had to make some god awful excuse for the slow response like, “Sorry the elevation is getting the best of us.” I impulsively said yes. We didn't have other options or another plan and he intentionally increased his odds by parking far away from the entrance.\n\nAt the ruin, David was sweating from translating while we were sweating from the heat. In the eye-squinting sun, I said with a shit-eating-grin, “Spanish los diablos?” as a statement and a question at the same time. I hoped that comment showed him that we at least cared about the complexity of colonialism in relation to his people, the Quechua. It turned out disrespecting the Spanish was a great way to get on the good side of Señior David. He cracked a smile and told us about his real struggle and love of his people's history. He opened up like a bottle of wine that you had to fish out a rotten cork. David worshiped the old Gods and felt uncomfortable with many of the adjustments of the modern era. You could hear the pain in his voice when he told the stories of his ancestors. We were in the presence of where large celebrations were held, complicated tunnels were made, and amazing feats of architecture erected. The pain and pride echoed in stories of his people lost and culture bleached away. David and the Quechua people had a remarkable amount of resilience, wit, wisdom, and history. It had been about a week into the trip and every segment was articulated with historical tensions and new world realities. The authenticity was a breath of fresh air and acknowledging the complicated history was a necessary bottle neck.\n\nWe walked and talked our way down the spiritual landscape. Our party stopped when we noticed blacked out shades, dark enough to look through you, singling us out. The seguridad were not physically dominating men but they were very serious. David was caught with his hand in the cookie jar as we realized what was going on. David parked far away from the entrance to avoid paying an entrance fee. I got basked in the guilty pleasure of watching the confrontation as David was arguing on crumbling ground. The absurdity (fully grown men yelling at one another over a piece of paper) joyously adhered to the reptilian part of my brain. We eventually snaked through the tunnels after David’s vein popping conversation and David facetiously waving a freshly minted paper in front of the security.\n\nThe tunnels were a place of wonder: they were spirited, jagged, and filled with meaning. You could easily get lost or hit your head, preferably not at the same time. Had we had the perfect guide on every trip – I probably wouldn’t have heard the raw and authentic perspective that poured out of David. Saying yes to the unpolished guide was not the most popular opinion amongst the three amigos when it happened but it was a memorable one. Yes and discomfort are often synonyms in travel. Choosing to travel is choosing to open up – sometimes, you just have to figure out how to purge the rotten cork.",
        "date": "09/24/2024",
        "url": ""
    }
]